export default {
  releaseNotes: [
    {
      ver: "v2.1.-1",
      time: "2024/02/10",
      notes: {
        zh_CN: [
          "dnq Eo*3b",
          "🐉",
          "真的没有了（才不信"
        ],
        zh_TW: [
          "dnq Eo*3b",
          "🐉",
          "真的沒有了（才不信"
        ],
        en_US: [
          "dnq Eo*3b",
          "🐉",
          "Nothing else (but i don't believe"
        ],
      },
    },
    {
      ver: "v2.1.0",
      time: "2024/02/05",
      notes: {
        zh_CN: [
          "使用全新数据库存储数据",
          "新增多语言支持",
          "接入 TapTap",
          "优化谱面选择界面",
          "多人游戏回到单人游戏无需刷新页面",
          "谱面收藏功能优化",
          "优化了最佳成绩显示",
          "优化了性能",
          "移除了 him"
        ],
        zh_TW: [
          "使用全新資料庫存儲數據",
          "新增多語言支持",
          "接入 TapTap(.cn)",
          "改進譜面選擇頁面",
          "多人遊戲回到單人遊戲無需刷新頁面",
          "譜面收藏功能優化",
          "改進了最佳成績顯示",
          "改進了效能",
          "移除了 him"
        ],
        en_US: [
          "Use brand new database to store data.",
          "Add multi-language support.",
          "Works with TapTap(.cn).",
          "Improve chart select page.",
          "You don't need to refresh the page when exitting multiplayer mode.",
          "Improve favourite chart function",
          "Improve best score display.",
          "Improve performance",
          "Removed Herobrine"
        ],
      },
    },
    {
      ver: "v2.0.0",
      time: "2023/10/05",
      notes: {
        zh_CN: [
          "优化游玩界面",
          "集成PhiZone v2",
          "适配RPE文字判定线特性",
          "适配RPE判定线UI绑定特性",
          "新增练习模式 支持调整播放时间及速度",
          "新增预览模式 支持练习模式的全部特性",
          "关于页面中展示爱发电的捐赠者",
          "全新打击音效",
          "(并不)全新的结算背景音乐",
          "页面顶端导航栏显示当前页面及玩家信息",
          "使用全新血量算法",
          "暂停页面显示游玩统计信息",
        ],
      },
    },
    {
      ver: "v1.3.2h14",
      time: "2023/07/27",
      notes: {
        zh_CN: [
          "修复Note大小调整相关的bug",
          "谱面选择界面显示最佳成绩"
        ],
      },
    },
    {
      ver: "v1.3.2h13",
      time: "2023/07/26",
      notes: {
        zh_CN: [
          "PT社区谱面支持搜索",
          "修复了PT社区谱面无法更新的 bug"
        ],
      },
    },
    {
      ver: "v1.3.2h12",
      time: "2023/07/26",
      notes: {
        zh_CN: [
          "修复了一些 bug"
        ],
      },
    },
    {
      ver: "v1.3.2h11",
      time: "2023/07/25",
      notes: {
        zh_CN: [
          "优化 PhiZone 登录,减少失败",
          "修复未登录可能无法游玩的问题",
          "修复 iOS 端血量条无法显示圆角的问题"
        ],
      },
    },
    {
      ver: "v1.3.2h10",
      time: "2023/07/22",
      notes: {
        zh_CN: [
          "适配一些常见 RPE 特性",
        ],
      },
    },
    {
      ver: "v1.3.2h9",
      time: "2023/07/21",
      notes: {
        zh_CN: [
          "自定义资源包支持打击特效随 Note 旋转",
          "自定义资源包支持自定义判定线及打击特效颜色",
          "修复与`自定义资源包`相关的一些 bug",
          "多人游戏中禁止暂停",
        ],
      },
    },
    {
      ver: "v1.3.2h8",
      time: "2023/07/14",
      notes: {
        zh_CN: [
          "iOS App 导出游玩回放文件时显示二维码,方便在无法复制到剪贴板时下载文件",
          "登录页面支持回车登录",
          "将`更新日志`按钮移到主界面下方",
          "优化全屏判定逻辑",
          "修改血量条样式",
          "修复若干 bugs",
        ],
      },
    },
    {
      ver: "v1.3.2h7",
      time: "2023/07/10",
      notes: {
        zh_CN: [
          "优化 PT社区谱面 加载,减轻服务器负担"
        ],
      },
    },
    {
      ver: "v1.3.2h6",
      time: "2023/07/10",
      notes: {
        zh_CN: [
          "本地曲目结算页面显示 PhiZone 用户信息",
          "优化离线游玩体验"
        ],
      },
    },
    {
      ver: "v1.3.2h5",
      time: "2023/07/09",
      notes: {
        zh_CN: [
          "修复bugs"
        ],
      },
    },
    {
      ver: "v1.3.2h4",
      time: "2023/07/09",
      notes: {
        zh_CN: [
          "优化在线资源包使用",
          "增加谱面特定资源包"
        ],
      },
    },
    {
      ver: "v1.3.2h3",
      time: "2023/07/09",
      notes: {
        zh_CN: [
          "新增转板模式：在单人游戏中,双击左下角可以进行转板操作",
          "上线更新日志",
          "取消选谱界面点击“选择”按钮时的二次确认",
          "新增全屏判定(实验性功能,可能会在后续版本中下架)"
        ],
      },
    },
    {
      ver: "v1.3.2h2",
      time: "2023/07/08",
      notes: {
        zh_CN: [
          "修复与PT社区谱面相关的bug",
          "优化PT社区谱面加载速度"
        ],
      },
    },
    {
      ver: "v1.3.2h1",
      time: "2023/07/08",
      notes: {
        zh_CN: [
          "修复导出游玩记录相关bug"
        ],
      },
    },
    {
      ver: "v1.3.2",
      time: "2023/07/07",
      notes: {
        zh_CN: [
          "重大更新：添加了额外选项-PT社区谱面 所有谱面均有授权！ 加载不出来的请清除缓存再此尝试！",
          "预计8日-10日发布比赛PV"
        ],
      },
    },
    {
      ver: "v1.3.2h2",
      time: "2023/07/04",
      notes: {
        zh_CN: [
          "修复了在线资源包功能",
          "iOS App增加生成游玩回放下载链接功能",
          "修复iOS App无法下載回放文件的问题",
          "移除了him",
          "修复了无法游戏全屏的问题"
        ],
      },
    },
    {
      ver: "v1.3.0",
      time: "2023/06/24",
      notes: {
        zh_CN: [
          "新增游玩回放功能，可以导出单人游玩回放，并可以导出房间内成员的游玩回放。",
          "支持使用资源包内打击音效。(感謝@星鹿ELEC)",
          "避免加载与上次相同谱面时重复加载的问题。",
          "变速成绩不再上传 PhiZone。",
          "微调Flick判定。",
          "修复部分显示问题。",
          "修复其他已知bug。"
        ],
      },
    },
    {
      ver: "v1.2.2",
      time: "2023/05/15",
      notes: {
        zh_CN: [
          "PhiZone B20查询",
          "单曲游玩记录排名查看（快速定位到自己的游玩记录和排除重复重复分数的排名暂未开发）",
          "上传分数不再经过PT服务器中转，直接由浏览器上传至PhiZone。"
        ],
      },
    },
    {
      ver: "v1.2.1",
      time: "2023/05/03",
      notes: {
        zh_CN: [
          "支持iOS设备游玩自定义谱面和使用自定义资源包",
          "在联机过程中出现本地谱面库没有的谱面会提示上传，现传现玩",
          "支持编辑本地谱面基本信息",
          "支持使用图片判定线等额外资源的谱面导入",
        ],
      },
    },
    {
      ver: "v1.2.0",
      time: "2023/05/02",
      notes: {
        zh_CN: [
          "添加本地谱面库功能，允许导入谱面文件到库并联机",
          "本地谱面支持搜索和分页",
          "增加一个新的 PhiTogether 预设资源包",
          "添加自定义资源包功能，并支持保存该资源包，在启动时自动应用",
          "浏览谱面列表时可直接跳转到对应页码",
          "支持Fiter 滤镜功能",
          "修复了iOS 16.4+ 无法正常游玩谱面的问题",
          "修复了游戏画面错位问题",
          "修改部分文字",
          "移除了“皮在一起模拟器”隐藏入口",
          "移除了him",
        ],
      },
    },
    {
      ver: "v1.1.0",
      time: "2023/03/18",
      notes: {
        zh_CN: [
          "增加了加载页面中的Tips",
          "添加了关于页面中的运行正计时",
          "UI 调整",
          "主页（未登录显示样式调整）",
          "关于页面（几项小修改）",
          "其它小样式修复",
          "修复了一些小 Bug",
          "优化 Safari 触控",
        ]
      },
    },
  ],
};